Revit 2027 API
SATImportOptions(SATImportOptions) Constructor
 Constructs a new instance of SATImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SATImportOptions(
	SATImportOptions option
)
Public Sub New (
	option As SATImportOptions
)
public:
SATImportOptions(
	SATImportOptions^ option
)
new :
        option : SATImportOptions -> SATImportOptions
Parameters
option SATImportOptions
 The SAT options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SATImportOptions Class
SATImportOptions Overload
Autodesk.Revit.DB Namespace